Documents/ВыпускПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ВыпускПродукции</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТрудозатратыНезавершенногоПроизводства</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходы</xr:Item>
				<xr:Item>InformationRegister.СуммыДокументовВВалютахУчета</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьТоваров</xr:Item>
				<xr:Item>AccumulationRegister.НДСУсловныеПродажи</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииПрочихРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеАктивыПассивы</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccumulationRegister.ДетализацияПартийТоваровДляНДС</xr:Item>
				<xr:Item>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ФактическиеДанныеБюджетирования</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДавальцуКОформлению</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ДетализацияПартийТоваровДляНДС2_4</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеЗаказовРаботами</xr:Item>
				<xr:Item>AccumulationRegister.МатериалыИРаботыВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкиНДСПартий</xr:Item>
				<xr:Item>AccumulationRegister.СвободныеОстатки</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияНоменклатураНоменклатура</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ГрафикПоступленияТоваров</xr:Item>
				<xr:Item>AccumulationRegister.РаспоряженияНаСписаниеПоНормативам</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходыНезавершенногоПроизводства</xr:Item>
				<xr:Item>AccumulationRegister.ПартииПроизводственныхЗатрат</xr:Item>
				<xr:Item>AccumulationRegister.ВыпускПродукции</xr:Item>
				<xr:Item>AccumulationRegister.ПартииНезавершенногоПроизводства</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
				<xr:Item>AccumulationRegister.РаспоряженияНаВыпускПродукции</xr:Item>
				<xr:Item>AccumulationRegister.ПартииЗатратНаВыпуск</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛистПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпускПоРаспоряжениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПриемкиТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПриемкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДавальца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Comment>Налоговое назначение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.МаршрутныйЛистПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСтоимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСтоимостиВыходныхИзделий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАналитикаУчетаПартий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Калькуляция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлановаяКалькуляция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередатьДавальцу</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыМаршрутныхЛистовПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыМаршрутныхЛистовПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыпускПродукции/Ext/ObjectModule.bsl
//++ Устарело_Производство21
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	Документы.ВыпускПродукции.ПроверитьСвязанныеОбъектыОбработаныОбработчикамиОбновления(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад Тогда
		ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);
	КонецЕсли; 
	
	//++ НЕ УТКА
	ЗаполнитьФлагПередатьДавальцуВТабличнойЧасти();
	//-- НЕ УТКА
	
	Если Не ВыпускПоРаспоряжениям Тогда
		ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");
	КонецЕсли;
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ВыпускПродукции);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий);
    
	//++ НЕ УТКА
    Если ВыпускПоРаспоряжениям Тогда    
    
        НалоговоеНазначениеВыпуска = Неопределено; 
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЗаказНаПроизводство.НалоговоеНазначение, &НалоговоеНазначениеОрганизации) КАК НалоговоеНазначение
		|ИЗ
		|   Документ.ВыпускПродукции КАК ВыпускПродукции
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Документ.МаршрутныйЛистПроизводства КАК МаршрутныйЛист
		|	ПО
		|		ВыпускПродукции.Распоряжение = МаршрутныйЛист.Ссылка
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|	ПО
		|		ЗаказНаПроизводство.Ссылка = МаршрутныйЛист.Распоряжение
		|ГДЕ
		|	ВыпускПродукции.Ссылка = &Ссылка
		|");
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		Запрос.УстановитьПараметр("НалоговоеНазначениеОрганизации", Справочники.Организации.НалоговоеНазначениеНДС(Организация, Дата));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
            НалоговоеНазначениеВыпуска = Выборка.НалоговоеНазначение;
        КонецЕсли; 
        
        Если НалоговоеНазначение <> НалоговоеНазначениеВыпуска Тогда
            НалоговоеНазначение = НалоговоеНазначениеВыпуска;
        КонецЕсли; 
		
	КонецЕсли;	
	//-- НЕ УТКА
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		МестаУчета = РегистрыСведений.АналитикаУчетаНоменклатуры.МестаУчета(
			Перечисления.ХозяйственныеОперации.ВыпускПродукции,
			Склад,
			Подразделение,
			НЕОПРЕДЕЛЕНО);
		
		ИменаПолей = РегистрыСведений.АналитикаУчетаНоменклатуры.ИменаПолейКоллекцииПоУмолчанию();
		
		Если НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад Тогда
			ИменаПолей.Вставить("Произвольный", "Склад");
		Иначе
			ИменаПолей.Вставить("Произвольный", "Подразделение");
			ИменаПолей.Вставить("Работа", "Подразделение");
		КонецЕсли;
		
		РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(
			Товары,
			МестаУчета,
			ИменаПолей);
		
		ЗаполнитьВидыЗапасовДокумента();
		ВзаиморасчетыСервер.ЗаполнитьИдентификаторыСтрокВТабличнойЧасти(Товары);
		
	КонецЕсли;
    
	// Заполним распоряжение в табличной части
	Если ЗначениеЗаполнено(Распоряжение) Тогда
		Для Каждого СтрокаТовары Из Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТовары.Распоряжение) Тогда
				СтрокаТовары.Распоряжение = Распоряжение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	// Выбор статей и аналитик.
	ПараметрыВыбора = Документы.ВыпускПродукции.ПараметрыВыбораСтатейИАналитик(НаправлениеВыпуска);
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбора);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Перем РеквизитыШапки;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения);
		
	//++ НЕ УТКА
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.МаршрутныйЛистПроизводства") Тогда
		
		ЗаполнитьПоРаспоряжению(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДанныеРаспоряжений") Тогда
		
		ДанныеЗаполнения.Свойство("РеквизитыШапки", РеквизитыШапки);
		
		ЗаполнитьПоРаспоряжению(ДанныеЗаполнения.ДанныеРаспоряжений, РеквизитыШапки);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("Массив") И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ЗаказДавальца") Тогда
		
		ЗаполнитьПоЗаказуДавальца(ДанныеЗаполнения);
		
	//-- НЕ УТКА
		
	КонецЕсли;
	
	//++ НЕ УТКА
	Если ВыпускПоРаспоряжениям Тогда
		Документы.ВыпускПродукции.ЗаполнитьСерииПоМаршрутнымЛистам(ЭтотОбъект);
	КонецЕсли;
	//-- НЕ УТКА
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
	Распоряжение = ДокументОснованиеПриЗаполнении(ДанныеЗаполнения);
	ВариантПриемкиТоваров = ЗакупкиСервер.ПолучитьВариантПриемкиТоваров(Распоряжение);
	
	// Выбор статей и аналитик.
	ПараметрыВыбора = Документы.ВыпускПродукции.ПараметрыВыбораСтатейИАналитик(НаправлениеВыпуска);
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбора);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ПроверитьВозможностьОкругления = (НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад);
	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
												НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ВыпускПродукции),
												Отказ,
												МассивНепроверяемыхРеквизитов);
												
	Если ВыпускПоРаспоряжениям Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Спецификация");
        МассивНепроверяемыхРеквизитов.Добавить("НалоговоеНазначение");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Распоряжение");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КодСтроки");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ТипСтоимости");
	КонецЕсли;
	
	Если НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Подразделение");
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Склад");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Цена");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Сумма");
	
	ПроверитьЗаполнениеТовары(Отказ);
		
	ЗакупкиСервер.ПроверитьКорректностьЗаполненияДокументаЗакупки(ЭтотОбъект,Отказ);
		
	// Удалим не проверяемые реквизиты
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		МассивНепроверяемыхРеквизитов);
		
	
	// Выбор статей и аналитик.
	ПараметрыВыбора = Документы.ВыпускПродукции.ПараметрыВыбораСтатейИАналитик(НаправлениеВыпуска);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбора);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ПараметрыЗаполненияВидовЗапасов", ЗапасыСервер.ПараметрыЗаполненияВидовЗапасов());
	
	ВнутреннееТовародвижение.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ДополнительныеСвойства.Вставить("ПараметрыЗаполненияВидовЗапасов", ЗапасыСервер.ПараметрыЗаполненияВидовЗапасов());
	
	ВнутреннееТовародвижение.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	//++ НЕ УТКА
	Распоряжение = Документы.МаршрутныйЛистПроизводства.ПустаяСсылка();
	//-- НЕ УТКА 
	
	МаксимальныйКодСтроки = 0;
	
	ВыпускПоРаспоряжениям = Ложь;
	ДокументОснование = Неопределено;
	
	Серии.Очистить();
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		СтрокаТовары.Распоряжение = Неопределено;
		СтрокаТовары.КодСтроки = 0;
		
	КонецЦикла;
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

// Заполняет реквизиты документа значениями по умолчанию.
//
Процедура ЗаполнитьРеквизитыПоУмолчанию()
	
	Ответственный  = Пользователи.ТекущийПользователь();
	Организация    = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	ВидЦены        = Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ(ВидЦены);
	Валюта         = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(ВидЦены).ВалютаЦены);
	
	Если Не ЗначениеЗаполнено(НаправлениеВыпуска) Тогда
		НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
	КонецЕсли;
	
    ЗаполнитьНалоговоеНазначение();
	
КонецПроцедуры

//++ НЕ УТКА
Процедура ЗаполнитьПоРаспоряжению(ДанныеЗаполнения, РеквизитыШапки = Неопределено)
	
	ТипДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныеЗаполнения = Тип("Массив") Тогда
		
		// Передали массив структур, содержащих данные о распоряжении (Распоряжение, КодСтроки).
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);
		
	ИначеЕсли ТипДанныеЗаполнения = Тип("ДокументСсылка.МаршрутныйЛистПроизводства") Тогда
		
		Распоряжение = ДанныеЗаполнения;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВыходныеИзделия.Получатель ССЫЛКА Справочник.Склады
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускпродукцииНаСклад)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускпродукцииВПодразделение)
		|	КОНЕЦ КАК НаправлениеВыпуска
		|ПОМЕСТИТЬ ВТНаправленияВыпуска
		|ИЗ
		|	Документ.МаршрутныйЛистПроизводства.ВыходныеИзделия КАК ВыходныеИзделия
		|ГДЕ
		|	ВыходныеИзделия.Ссылка = &Распоряжение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВозвратныеОтходы.Получатель ССЫЛКА Справочник.Склады
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускпродукцииНаСклад)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускпродукцииВПодразделение)
		|	КОНЕЦ
		|ИЗ
		|	Документ.МаршрутныйЛистПроизводства.ВозвратныеОтходы КАК ВозвратныеОтходы
		|ГДЕ
		|	ВозвратныеОтходы.Ссылка = &Распоряжение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТНаправленияВыпуска.НаправлениеВыпуска) КАК НаправлениеВыпуска,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТНаправленияВыпуска.НаправлениеВыпуска) КАК КоличествоНаправленийВДокументе
		|ПОМЕСТИТЬ НаправленияВыпуска
		|ИЗ
		|	ВТНаправленияВыпуска КАК ВТНаправленияВыпуска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Распоряжение,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Подразделение КАК Подразделение,
		|	НЕ ТаблицаДокумента.Проведен КАК ЕстьОшибкиПроведен,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЛистовПроизводства.Выполнен)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	ТаблицаДокумента.Статус КАК СтатусДокумента,
		|	НаправленияВыпуска.НаправлениеВыпуска КАК НаправлениеВыпуска,
		|	НаправленияВыпуска.КоличествоНаправленийВДокументе КАК КоличествоНаправленийВДокументе,
		|	ТаблицаДокумента.Распоряжение.НаправлениеДеятельности КАК НаправлениеДеятельности 
		|ИЗ
		|	Документ.МаршрутныйЛистПроизводства КАК ТаблицаДокумента,
		|	НаправленияВыпуска КАК НаправленияВыпуска
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Распоряжение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыходныеИзделия.Получатель КАК Склад
		|ИЗ
		|	Документ.МаршрутныйЛистПроизводства.ВыходныеИзделия КАК ВыходныеИзделия
		|ГДЕ
		|	ВыходныеИзделия.Ссылка = &Распоряжение
		|	И ВыходныеИзделия.Получатель ССЫЛКА Справочник.Склады
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратныеОтходы.Получатель
		|ИЗ
		|	Документ.МаршрутныйЛистПроизводства.ВозвратныеОтходы КАК ВозвратныеОтходы
		|ГДЕ
		|	ВозвратныеОтходы.Ссылка = &Распоряжение
		|	И ВозвратныеОтходы.Получатель ССЫЛКА Справочник.Склады");
		
		Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
		
		Результаты = Запрос.ВыполнитьПакет();
		
		РеквизитыРаспоряжения = Результаты[2].Выбрать();
		РеквизитыРаспоряжения.Следующий();
		
		МассивДопустимыхСтатусов = Новый Массив();
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыМаршрутныхЛистовПроизводства.Выполнен);
		
		Если РеквизитыРаспоряжения.КоличествоНаправленийВДокументе > 1 Тогда
			
			ТекстОшибки = НСтр("ru='Маршрутный лист содержит разные направления выпуска. 
|Ввод одного документа на основании выбранного распоряжения невозможен.
|Оформить выпуск можно в рабочем месте ""Выпуск продукции и выполнение работ"".'
|;uk='Маршрутний лист містить різні напрями випуску. 
|Введення одного документа на підставі вибраного розпорядження неможливе.
|Оформити випуск можна в робочому місці ""Випуск продукції та виконання робіт"".'");
			ВызватьИсключение ТекстОшибки;
			
		ИначеЕсли РеквизитыРаспоряжения.НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад Тогда
			
			МассивСкладов = Результаты[3].Выгрузить().ВыгрузитьКолонку("Склад");
			
			СкладДляЗаполнения = Документы.ВыпускПродукции.СкладШапкиПоМассиву(МассивСкладов);
			
			Если СкладДляЗаполнения = Неопределено Тогда
				ТекстОшибки = НСтр("ru='В маршрутном листе определено поступление на разные склады.
|Ввод одного документа на основании выбранного распоряжения невозможен.
|Оформить выпуск можно в рабочем месте ""Выпуск продукции и выполнение работ"".'
|;uk='У маршрутному листі визначено надходження на різні склади.
|Введення одного документа на підставі вибраного розпорядження неможливо.
|Оформити випуск можна в робочому місці ""Випуск продукції та виконання робіт"".'");
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			ЭтотОбъект.Склад = СкладДляЗаполнения;
			
		КонецЕсли;
		
		ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
			РеквизитыРаспоряжения.Распоряжение,
			РеквизитыРаспоряжения.СтатусДокумента,
			РеквизитыРаспоряжения.ЕстьОшибкиПроведен,
			РеквизитыРаспоряжения.ЕстьОшибкиСтатус,
			МассивДопустимыхСтатусов);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыРаспоряжения);
		
	КонецЕсли;
	
	МассивРаспоряжений = Новый Массив;
	Если ТипДанныеЗаполнения = Тип("Массив") Тогда
		// Передали массив структур, содержащих данные о распоряжении (Распоряжение, КодСтроки).
		ДанныеРаспоряжений = ДанныеЗаполнения;
		Для каждого СтруктураРаспоряжения Из ДанныеЗаполнения Цикл
			МассивРаспоряжений.Добавить(СтруктураРаспоряжения.Распоряжение);
		КонецЦикла; 
	Иначе	
		ДанныеРаспоряжений = Неопределено;
		МассивРаспоряжений.Добавить(Распоряжение);
	КонецЕсли;
	
	ВидЦены  = Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ(ВидЦены);
	Валюта   = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(ВидЦены).ВалютаЦены);
	
	ДанныеОтбора = Новый Структура("Ссылка,Дата,Организация,Подразделение,НаправлениеВыпуска, ВидЦены, Валюта");
	ЗаполнитьЗначенияСвойств(ДанныеОтбора, ЭтотОбъект);
	Если РеквизитыШапки <> Неопределено И РеквизитыШапки.Свойство("РабочийЦентр") Тогда
		ДанныеОтбора.Вставить("РабочийЦентр", РеквизитыШапки.РабочийЦентр);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
		ДанныеОтбора.Вставить("Склад", ЭтотОбъект.Склад);
	КонецЕсли;
	
	ВыпускПоРаспоряжениям = Истина;
	
	Документы.ВыпускПродукции.ЗаполнитьПоОстаткамРаспоряжений(ДанныеОтбора, Товары, МассивРаспоряжений,, ДанныеРаспоряжений);
	
	ЗаказыСервер.ЗаполнитьЗаказВШапкеПоЗаказамВТабличнойЧасти(Распоряжение, Товары, "Распоряжение");
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуДавальца(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Количество() = 1 Тогда
		ДокументОснование = ДанныеЗаполнения[0];
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЗаказДавальца.Организация) КАК Организация,
	|	МАКСИМУМ(ЗаказДавальца.Подразделение) КАК Подразделение,
	|	МАКСИМУМ(ЗаказДавальца.НаправлениеДеятельности) КАК НаправлениеДеятельности,
    |	МАКСИМУМ(ЗаказДавальца.НалоговоеНазначение) КАК НалоговоеНазначение,
	|	МАКСИМУМ(НЕ ЗаказДавальца.Проведен) КАК ЕстьОшибкиПроведен,
	|	МИНИМУМ(ЗаказДавальца.Статус) КАК Статус,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаказДавальца.Статус В (&МассивДопустимыхСтатусов)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьОшибкиСтатус,
	|	МАКСИМУМ(ЗаказДавальца.Склад) КАК Склад,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускпродукцииНаСклад) КАК НаправлениеВыпуска,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказДавальца.Организация) КАК КоличествоОрганизаций,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказДавальца.Подразделение) КАК КоличествоПодразделений,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказДавальца.Склад) КАК КоличествоСкладов,
    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказДавальца.НалоговоеНазначение) КАК КоличествоВариантовНалоговыхНазначений,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказДавальца.НаправлениеДеятельности) КАК КоличествоНаправленийДеятельности
	|ИЗ
	|	Документ.ЗаказДавальца КАК ЗаказДавальца
	|ГДЕ
	|	ЗаказДавальца.Ссылка В(&ЗаказыДавальца)
	|;
	|
	|//////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура          КАК Номенклатура,
	|	Товары.Характеристика        КАК Характеристика,
	|	Товары.Склад                 КАК Склад,
	|	Товары.Ссылка.Назначение     КАК Назначение,
	|	СУММА(Товары.Количество)     КАК Количество,
	|	МИНИМУМ(Товары.Спецификация) КАК Спецификация,
	|	МИНИМУМ(Товары.Упаковка)     КАК Упаковка,
	|	МИНИМУМ(Товары.НомерСтроки)  КАК НомерСтроки
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	Документ.ЗаказДавальца.Продукция КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&ЗаказыДавальца)
	|	И НЕ Товары.Отменено
	|	И Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно)
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура, Товары.Характеристика, Товары.Склад, Товары.Ссылка.Назначение
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура, Характеристика, Склад, Назначение
	|;
	|
	|//////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатки.Номенклатура   КАК Номенклатура,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаОстатки.Склад          КАК Склад,
	|	ТаблицаОстатки.Назначение     КАК Назначение,
	|	ТаблицаОстатки.КЗаказуОстаток КАК Количество
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов.Остатки(,
	|		(Номенклатура, Характеристика, Склад, Назначение) В(
	|			ВЫБРАТЬ
	|				Товары.Номенклатура   КАК Номенклатура,
	|				Товары.Характеристика КАК Характеристика,
	|				Товары.Склад          КАК Склад,
	|				Товары.Назначение     КАК Назначение
	|			ИЗ
	|				ВтТовары КАК Товары)) КАК ТаблицаОстатки
	|ГДЕ
	|	ТаблицаОстатки.КЗаказуОстаток > 0
	|;
	|
	|//////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатки.Номенклатура   КАК Номенклатура,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаОстатки.Склад          КАК Склад,
	|	ТаблицаОстатки.Назначение     КАК Назначение,
	|	
	|	ВЫБОР КОГДА ТаблицаОстатки.Количество < Товары.Количество ТОГДА
	|				ТаблицаОстатки.Количество
	|			ИНАЧЕ
	|				Товары.Количество
	|		КОНЕЦ                     КАК Количество,
	|	
	|	Товары.Упаковка               КАК Упаковка,
	|	Товары.НомерСтроки            КАК НомерСтроки,
	|	Товары.Спецификация           КАК Спецификация,
	|	
	|	ВЫБОР КОГДА ТаблицаОстатки.Количество < Товары.Количество ТОГДА
	|				ТаблицаОстатки.Количество
	|			ИНАЧЕ
	|				Товары.Количество
	|		КОНЕЦ / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоличествоУпаковок
	|ИЗ
	|	ВтОстатки КАК ТаблицаОстатки
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТовары КАК Товары
	|		ПО Товары.Номенклатура   = ТаблицаОстатки.Номенклатура
	|		 И Товары.Характеристика = ТаблицаОстатки.Характеристика
	|		 И Товары.Склад          = ТаблицаОстатки.Склад
	|		 И Товары.Назначение     = ТаблицаОстатки.Назначение
	|		
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовДавальцев.КПроизводству);
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовДавальцев.КОтгрузке);
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовДавальцев.Закрыт);
	
	Запрос.УстановитьПараметр("ЗаказыДавальца", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("МассивДопустимыхСтатусов", МассивДопустимыхСтатусов);
	
	Подстановка = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки("Товары.Упаковка", "Товары.Номенклатура");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки", Подстановка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Реквизиты = Результат[0].Выбрать();
	
	Если Не Реквизиты.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Если Реквизиты.КоличествоОрганизаций > 1 Тогда
		ТекстОшибки = НСтр("ru='Невозможно оформить выпуск продукции по разным организациям.';uk='Неможливо оформити випуск продукції по різних організаціях.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если Реквизиты.КоличествоСкладов > 1 Тогда
		ТекстОшибки = НСтр("ru='Невозможно оформить один документ, т.к. продукция должна быть выпущена на разные склады.';uk='Неможливо оформити один документ, оскільки продукція повинна бути випущена на різні склади.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если Реквизиты.КоличествоПодразделений > 1 Тогда
		ТекстОшибки = НСтр("ru='Невозможно оформить один документ, т.к. продукцию выпускают разные подразделения.';uk='Неможливо оформити один документ, тому що продукцію випускають різні підрозділи.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если Реквизиты.ЕстьОшибкиСтатус Тогда
		ТекстОшибки = НСтр("ru='Для оформления выпуска продукции заказ должен быть в статусе ""К производству"", ""К отгрузке"" или ""Закрыт"".';uk='Для оформлення випуску продукції замовлення повинно бути в статус ""До виробництва"", ""До відвантаження"" або ""Закрито"".'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если Результат[3].Пустой() Тогда
		ТекстОшибки = НСтр("ru='Вся продукция уже  выпущена, ввод на основании не требуется.';uk='Вся продукція вже випущена, введення на підставі не потрібно.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
    Если Реквизиты.КоличествоВариантовНалоговыхНазначений > 1 Тогда
    	ТекстОшибки = НСтр("ru='Невозможно оформить один документ, т.к. выбранные заказы оформлены под разные налоговые назначения.';uk='Неможливо оформити один документ, тому що вибрані замовлення оформлені під різні податкові призначення.'");
    	ВызватьИсключение ТекстОшибки;
    КонецЕсли;
	Если Реквизиты.КоличествоНаправленийДеятельности > 1 Тогда
		ТекстОшибки = НСтр("ru='Невозможно оформить один документ, т.к. выбранные заказы оформлены под разные направления деятельности.';uk='Неможливо оформити один документ, тому що вибрані замовлення оформлені під різні напрями діяльності.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);
	
	Товары.Загрузить(Результат[3].Выгрузить());
	
	МассивДанных = Новый Массив;
	МассивСтрок = Новый Массив;
	
	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыВыбораСпецификаций(ЭтотОбъект, Документы.ВыпускПродукции);
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	Для Каждого Строка Из Товары Цикл
		
		ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СобратьДанныеОбИзделииДляВыбораСпецификации(
			ЭтотОбъект, Строка, ПараметрыВыбораСпецификаций);
		ДанныеОбИзделии.НачалоПроизводства = ТекущаяДатаСеанса;
		
		МассивДанных.Добавить(ДанныеОбИзделии);
		МассивСтрок.Добавить(Строка);
		
	КонецЦикла;
	
	УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций);
	
	УправлениеДаннымиОбИзделиях.ЗаполнитьСлужебныеРеквизитыПоСпецификации(Товары, "ТипСтоимости");
	
КонецПроцедуры
//-- НЕ УТКА

Процедура ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения)
	
	ЗаказКлиента = ДанныеЗаполнения;
	ДокументОснование = ЗаказКлиента;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускпродукцииНаСклад) КАК НаправлениеВыпуска,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Подразделение,
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Склад,
	|	НЕ ЗаказКлиента.Проведен КАК ЕстьОшибкиПроведен,
	|	
	|	ВЫБОР КОГДА ЗаказКлиента.НаправлениеДеятельности.УчетЗатрат ТОГДА
	|			ЗаказКлиента.НаправлениеДеятельности
	|		КОНЕЦ КАК НаправлениеДеятельности,
	|	
	|	ЗаказКлиента.Статус
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента");
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Документы.ЗаказКлиента.ПроверитьВозможностьВводаНаОсновании(
		ЗаказКлиента,
		Реквизиты.Статус,
		Реквизиты.ЕстьОшибкиПроведен,
		Истина);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);
	
	ПараметрыТаблицыТовары = ОбеспечениеСервер.ПараметрыТаблицыОстатковПоЗаказу();
	ТаблицаТовары          = ОбеспечениеСервер.ТаблицаОстатковКЗаказу(ЗаказКлиента, ПараметрыТаблицыТовары);
	
	Товары.Загрузить(ТаблицаТовары);
	
	МассивДанных = Новый Массив;
	МассивСтрок = Новый Массив;
	
	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыВыбораСпецификаций(ЭтотОбъект, Документы.ВыпускПродукции);
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	Для Каждого Строка Из Товары Цикл
		
		ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СобратьДанныеОбИзделииДляВыбораСпецификации(
			ЭтотОбъект, Строка, ПараметрыВыбораСпецификаций);
		ДанныеОбИзделии.НачалоПроизводства = ТекущаяДатаСеанса;
		
		МассивДанных.Добавить(ДанныеОбИзделии);
		МассивСтрок.Добавить(Строка);
		
		Строка.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
		
	КонецЦикла;
	
	УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций);
	
	УправлениеДаннымиОбИзделиях.ЗаполнитьСлужебныеРеквизитыПоСпецификации(Товары, "ТипСтоимости");
	
КонецПроцедуры

Функция ДокументОснованиеПриЗаполнении(ДанныеЗаполнения)
	
//++ НЕ УТКА
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.МаршрутныйЛистПроизводства") Тогда
		
		Возврат ДанныеЗаполнения;
		
	ИначеЕсли (ТипЗнч(ДанныеЗаполнения) = Тип("Массив")
		И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.МаршрутныйЛистПроизводства")) Тогда
		
		Возврат ДанныеЗаполнения[0];
		
	КонецЕсли;
//-- НЕ УТКА
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ВидыЗапасов

Процедура ЗаполнитьВидыЗапасовДокумента()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ВидЗапасов КАК ВидЗапасов,
	|	ТаблицаТоваров.Распоряжение КАК Распоряжение,
	|	ВЫРАЗИТЬ (ТаблицаТоваров.Назначение КАК Справочник.Назначения) КАК Назначение
	|ПОМЕСТИТЬ ТаблицаТоваровДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки									КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура									КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Проведен
	|			ТОГДА ТаблицаТоваров.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ТекущийВидЗапасов,
	|	ЛОЖЬ														КАК ЭтоВозвратнаяТара,
	|	&Организация												КАК Организация,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА НЕ ЗаказДавальца.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья) 
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) 
	|	КОНЕЦ														КАК ХозяйственнаяОперация,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА НЕ ЗаказДавальца.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	КОНЕЦ														КАК ТипЗапасов, 
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА НЕ ЗаказДавальца.Партнер ЕСТЬ NULL
	|			ТОГДА ЗаказДавальца.Партнер
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ														КАК ВладелецТовара, 
	|	ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)	КАК Соглашение,
	//++ НЕ УТКА
	|	ЕСТЬNULL(ЗаказДавальца.Контрагент, 
	//-- НЕ УТКА
	|				ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//++ НЕ УТКА
	|			)													
	//-- НЕ УТКА
	|																КАК Контрагент,
	//++ НЕ УТКА
	|	ЕСТЬNULL(ЗаказДавальца.Договор, 
	//-- НЕ УТКА
	|				ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//++ НЕ УТКА
	|			)
	//-- НЕ УТКА
	|																КАК Договор,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)					КАК Валюта,
	//++ НЕ УТКА
	|	ЕСТЬNULL(ЗаказНаПроизводство.НалоговоеНазначение, 
	//-- НЕ УТКА
	|		&НалоговоеНазначение
	//++ НЕ УТКА
	|	) 
	//-- НЕ УТКА
	|		КАК НалоговоеНазначение,
    |	&НалоговоеНазначениеОрганизации КАК НалоговоеНазначениеОрганизации, 
	|	(ВЫБОР
	|		КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|		КОГДА &НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ТОГДА СпрНоменклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК ГруппаПродукции
	|ПОМЕСТИТЬ ИсходнаяТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваровДокумента КАК ТаблицаТоваров
	|
	//++ НЕ УТКА
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.МаршрутныйЛистПроизводства КАК МаршрутныйЛист
	|	ПО
	|		ТаблицаТоваров.Распоряжение = МаршрутныйЛист.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаказНаПроизводство.Продукция КАК Заказ
	|	ПО
	|		МаршрутныйЛист.Распоряжение = Заказ.Ссылка
	|		И МаршрутныйЛист.КодСтроки = Заказ.КодСтроки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаказДавальца КАК ЗаказДавальца
	|	ПО
	|		(ЗаказДавальца.Ссылка = Заказ.Назначение.Заказ
	|			ИЛИ ЗаказДавальца.Ссылка = ТаблицаТоваров.Назначение.Заказ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|	ПО
	|		ЗаказНаПроизводство.Ссылка = МаршрутныйЛист.Распоряжение
	//-- НЕ УТКА
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ВидыЗапасов КАК ВидыЗапасов
	|	ПО
	|		ТаблицаТоваров.ВидЗапасов = ВидыЗапасов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО
	|		СпрНоменклатура.Ссылка = ТаблицаТоваров.Номенклатура
	|
	|ГДЕ
	|	ТаблицаТоваров.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	ИЛИ &ПерезаполнитьВидыЗапасов
	|	ИЛИ ВидыЗапасов.Организация <> &Организация
	|	ИЛИ ВидыЗапасов.ТипЗапасов <> 
	|		ВЫБОР
	//++ НЕ УТКА
	|			КОГДА НЕ ЗаказДавальца.Ссылка ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	//-- НЕ УТКА
	|			КОГДА ИСТИНА
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		КОНЕЦ
	|	ИЛИ ВидыЗапасов.НалоговоеНазначение <> 
	//++ НЕ УТКА
	|		ЕСТЬNULL(ЗаказНаПроизводство.НалоговоеНазначение, 
	//-- НЕ УТКА
	|			&НалоговоеНазначение
	//++ НЕ УТКА
	|		) 
	//-- НЕ УТКА
	|");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаТоваров", Товары.Выгрузить(, "НомерСтроки, Номенклатура, ВидЗапасов, Распоряжение, Назначение"));
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("Подразделение",  Справочники.СтруктураПредприятия.ПустаяСсылка());
	Запрос.УстановитьПараметр("НаправлениеВыпуска", НаправлениеВыпуска);
	Запрос.УстановитьПараметр("НалоговоеНазначение", НалоговоеНазначение);
	Запрос.УстановитьПараметр("НалоговоеНазначениеОрганизации", Справочники.Организации.НалоговоеНазначениеНДС(Организация, Дата));
	Запрос.УстановитьПараметр("Проведен", Проведен);
	
	ЗапасыСервер.ДополнитьВременныеТаблицыОбязательнымиКолонками(Запрос);
	ЗапасыСервер.ПроверитьНеобходимостьПерезаполненияВидовЗапасовДокумента(ЭтотОбъект, Запрос);
	
	Запрос.Выполнить();
	
	ЗапасыСервер.ЗаполнитьВидыЗапасовПоУмолчанию(МенеджерВременныхТаблиц, Товары);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ПроверитьЗаполнениеТовары(Отказ)

	ПериодУчетнойПолитики = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	ПараметрыПолитики = НастройкиНалоговУчетныхПолитикПовтИсп.ДействующиеПараметрыНалоговУчетныхПолитик("УчетнаяПолитикаФинансовогоУчета",
		Организация,
		ПериодУчетнойПолитики);
	
	Если ПараметрыПолитики <> Неопределено Тогда
		ИспользоватьПлановуюСтоимость = ПараметрыПолитики.УчетГотовойПродукцииПоПлановойСтоимости;
	Иначе
		ИспользоватьПлановуюСтоимость = Ложь;
	КонецЕсли;
	
	Для Каждого ДанныеСтроки Из Товары Цикл
		
		// Цена, Сумма
		Если ДанныеСтроки.ТипСтоимости = Перечисления.ТипыСтоимостиВыходныхИзделий.Фиксированная Тогда
		
			Если Не ЗначениеЗаполнено(ДанныеСтроки.Цена) Тогда
				
				ТекстСообщения = НСтр("ru='Не заполнена колонка ""Цена"" в строке %1 списка ""Товары и работы""';uk='Не заповнена колонка ""Ціна"" в рядку %1 списку ""Товари і роботи""'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДанныеСтроки.НомерСтроки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ДанныеСтроки.НомерСтроки, "Цена"),
					,
					Отказ);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.Сумма) Тогда
				
				ТекстСообщения = НСтр("ru='Не заполнена колонка ""Сумма"" в строке %1 списка ""Товары и работы""';uk='Не заповнена колонка ""Сума"" в рядку %1 списку ""Товари і роботи""'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДанныеСтроки.НомерСтроки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ДанныеСтроки.НомерСтроки, "Сумма"),
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//++ НЕ УТКА
Процедура ЗаполнитьФлагПередатьДавальцуВТабличнойЧасти()
	
	Если НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад
			И Не ВыпускПоРаспоряжениям Тогда
		
		УправлениеПроизводством.ЗаполнитьФлагПередатьДавальцуПоНазначениюВКоллекции(Товары);
		
	Иначе
		
		Для Каждого Строка Из Товары Цикл
			
			Строка.ПередатьДавальцу = Ложь;
			
		КонецЦикла;
		
		Если НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад И ВыпускПоРаспоряжениям Тогда
			
			Запрос = Новый Запрос();
			Запрос.Текст =
				"ВЫБРАТЬ
				|	Товары.НомерСтроки  КАК НомерСтроки,
				|	Товары.Распоряжение КАК Распоряжение,
				|	Товары.Назначение   КАК Назначение,
				|	Товары.КодСтроки    КАК КодСтроки
				|ПОМЕСТИТЬ ВтТовары
				|ИЗ
				|	&Товары КАК Товары
				|ГДЕ
				|	Товары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|;
				|
				|////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
				|ИЗ
				|	ВтТовары КАК ТаблицаТовары
				|		
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
				|		ПО ТаблицаТовары.Распоряжение.Распоряжение = ЗаказНаПроизводствоПродукция.Ссылка
				|		И ТаблицаТовары.Распоряжение.КодСтроки = ЗаказНаПроизводствоПродукция.КодСтроки
				|		
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства.ВыходныеИзделия КАК ВыходныеИзделияМаршрутногоЛиста
				|		ПО ТаблицаТовары.Распоряжение = ВыходныеИзделияМаршрутногоЛиста.Ссылка
				|		И ТаблицаТовары.КодСтроки = ВыходныеИзделияМаршрутногоЛиста.КодСтроки
				|		И ВыходныеИзделияМаршрутногоЛиста.ПроизводитсяВПроцессе
				|		
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства.ВозвратныеОтходы КАК ВозвратныеОтходыМаршрутногоЛиста
				|		ПО ТаблицаТовары.Распоряжение = ВозвратныеОтходыМаршрутногоЛиста.Ссылка
				|		И ТаблицаТовары.КодСтроки = ВозвратныеОтходыМаршрутногоЛиста.КодСтроки
				|		И ВозвратныеОтходыМаршрутногоЛиста.ПроизводитсяВПроцессе
				|		
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
				|		ПО СпрНазначения.Ссылка = ТаблицаТовары.Назначение
				|ГДЕ
				|	СпрНазначения.Заказ ССЫЛКА Документ.ЗаказДавальца
				|	И ЗаказНаПроизводствоПродукция.КлючСвязиПродукция = &ПустойКлючСвязи
				|	И ВыходныеИзделияМаршрутногоЛиста.Ссылка ЕСТЬ NULL
				|	И ВозвратныеОтходыМаршрутногоЛиста.Ссылка ЕСТЬ NULL";
				
			Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(, "НомерСтроки, Распоряжение, Назначение, КодСтроки"));
			Запрос.УстановитьПараметр("ПустойКлючСвязи", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Товары[Выборка.НомерСтроки - 1].ПередатьДавальцу = Истина;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//-- НЕ УТКА

#КонецОбласти

Процедура ЗаполнитьНалоговоеНазначение()
	
	ПараметрыЗаполнения = Документы.ВыпускПродукции.ПараметрыЗаполненияНалоговогоНазначения(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьНалоговоеНазначение(НалоговоеНазначение, ПараметрыЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
//-- Устарело_Производство21
